src/InformationRegisters/Scan_ДетализацияПлановыхДанных/Scan_ДетализацияПлановыхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДетализацияПлановыхДанных</name>
  <resources>
    <name>SLA</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MZ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MS</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BusChassis</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Engines</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Buses</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BodybuiltUnits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Jenty</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>TruckOnTruckDelivery</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>JockeyTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>GenSetsTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVehicles</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVisits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AcceptanceHandoverDemoTestRent</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AdministrationOfVehiclesSales</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДетализацияПлановыхДанных/Forms/ФормаСписка/Module.bsl
// rarus tenkam 07.03.2018 mantis 9066 +++
&НаСервере
Функция ПолучитьПлановыеЗначенияИзРегистра(СтруктураОтбора)
	СтруктураДанных = РегистрыСведений.Scan_ДетализацияПлановыхДанных.Получить(СтруктураОтбора);
	Возврат СтруктураДанных;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначений(ТекХранилищеЗначений)
	Знч = ТекХранилищеЗначений.Получить();
	Если Знч <> Неопределено Тогда
		Возврат Знч.ВыгрузитьКолонку("Значение");
	КонецЕсли;
	Возврат Знч;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)	
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() <> 1 Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Необходимо выделить одну строку!");
		Сообщить(НСтр("ru = 'Необходимо выделить одну строку!'; en = 'Select one line!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Возврат
	КонецЕсли; 	
	
	// rarus tenkam 10.04.2019 mantis 14195 +++
	
	//СтруктураОтбора = Новый Структура("Год", Элементы.Список.ТекущиеДанные.Год);
	//СтруктураОтбора.Вставить("НомерНедели", Элементы.Список.ТекущиеДанные.НомерНедели);
	//ТекСтрока = ПолучитьПлановыеЗначенияИзРегистра(СтруктураОтбора);
	//
	//ИмяФайла = "Детализация плановых данных " + Элементы.Список.ТекущиеДанные.НомерНедели + "_" + Элементы.Список.ТекущиеДанные.Год;

	Оповещение = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение);

	// rarus tenkam 10.04.2019 mantis 14195 ---
	
	//ПутьКФайлу = ПолучитьПутьКФайлуВыгрузки(ИмяФайла);
	//Если ПутьКФайлу = "" Тогда
	//	Сообщить("Путь сохранения не выбран!");
	//	Возврат;		
	//КонецЕсли;   	
	//
	//Попытка
	//	Эксель = Новый COMОбъект("Excel.Application"); 
	//Исключение
	//	Сообщить(ОписаниеОшибки()); 
	//	Возврат;
	//КонецПопытки; 
	//Книга = Эксель.WorkBooks.Add();
	//
	//// QuantityOfVisits
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.QuantityOfVisits);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;                 		
	////При создании книги автоматически создаются листы (по умолчанию 3). Нам остается только выбрать нужный:
	//ЛистQuantityOfVisits = Книга.WorkSheets(1);
	//
	//ЛистQuantityOfVisits.Name = "QuantityOfVisits";         		
	//ЛистQuantityOfVisits.Cells(1, 1).Value = "QuantityOfVisits";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистQuantityOfVisits.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// AcceptanceHandoverDemoTestRent
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.AcceptanceHandoverDemoTestRent);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	//ЛистAcceptanceHandoverDemoTestRent = Книга.WorkSheets(2);
	//
	//ЛистAcceptanceHandoverDemoTestRent.Name = "AcceptanceHandoverDemoTestRent";       		
	//ЛистAcceptanceHandoverDemoTestRent.Cells(1, 1).Value = "AcceptanceHandoverDemoTestRent";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистAcceptanceHandoverDemoTestRent.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// AdministrationOfVehiclesSales
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.AdministrationOfVehiclesSales);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	//ЛистAdministrationOfVehiclesSales = Книга.WorkSheets(3);
	//
	//ЛистAdministrationOfVehiclesSales.Name = "AdministrationOfVehiclesSales";      		
	//ЛистAdministrationOfVehiclesSales.Cells(1, 1).Value = "AdministrationOfVehiclesSales";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистAdministrationOfVehiclesSales.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// QuantityOfVehicles
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.QuantityOfVehicles);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистQuantityOfVehicles = Книга.Sheets.Add();
	//
	//ЛистQuantityOfVehicles.Name = "QuantityOfVehicles";  		
	//ЛистQuantityOfVehicles.Cells(1, 1).Value = "QuantityOfVehicles";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистQuantityOfVehicles.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// GenSetsTransportation
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.GenSetsTransportation);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистGenSetsTransportation = Книга.Sheets.Add();
	//
	//ЛистGenSetsTransportation.Name = "GenSetsTransportation";  		
	//ЛистGenSetsTransportation.Cells(1, 1).Value = "GenSetsTransportation";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистGenSetsTransportation.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;

	//// JockeyTransportation
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.JockeyTransportation);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистJockeyTransportation = Книга.Sheets.Add();
	//
	//ЛистJockeyTransportation.Name = "JockeyTransportation";  		
	//ЛистJockeyTransportation.Cells(1, 1).Value = "JockeyTransportation";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистJockeyTransportation.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;  	
	//
	//// TruckOnTruckDelivery
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.TruckOnTruckDelivery);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистTruckOnTruckDelivery = Книга.Sheets.Add();
	//
	//ЛистTruckOnTruckDelivery.Name = "TruckOnTruckDelivery";  		
	//ЛистTruckOnTruckDelivery.Cells(1, 1).Value = "TruckOnTruckDelivery";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистTruckOnTruckDelivery.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// Jenty
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.Jenty);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистJenty = Книга.Sheets.Add();
	//
	//ЛистJenty.Name = "Jenty";  		
	//ЛистJenty.Cells(1, 1).Value = "Jenty";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистJenty.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла; 
	//	
	//// BodybuiltUnits
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.BodybuiltUnits);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистBodybuiltUnits = Книга.Sheets.Add();
	//
	//ЛистBodybuiltUnits.Name = "BodybuiltUnits";  		
	//ЛистBodybuiltUnits.Cells(1, 1).Value = "BodybuiltUnits";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистBodybuiltUnits.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;   
	//
	//// Buses
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.Buses);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистBuses = Книга.Sheets.Add();
	//
	//ЛистBuses.Name = "Buses";  		
	//ЛистBuses.Cells(1, 1).Value = "Buses";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистBuses.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;
	//
	//// Engines
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.Engines);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистEngines = Книга.Sheets.Add();
	//
	//ЛистEngines.Name = "Engines";  		
	//ЛистEngines.Cells(1, 1).Value = "Engines";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистEngines.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;

	//// BusChassis
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.BusChassis);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистBusChassis = Книга.Sheets.Add();
	//
	//ЛистBusChassis.Name = "BusChassis";  		
	//ЛистBusChassis.Cells(1, 1).Value = "BusChassis";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистBusChassis.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;

	//// MS
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.MS);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистMS = Книга.Sheets.Add();
	//
	//ЛистMS.Name = "MS";  		
	//ЛистMS.Cells(1, 1).Value = "MS";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистMS.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;

	//// MZ
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.MZ);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистMZ = Книга.Sheets.Add();
	//
	//ЛистMZ.Name = "MZ";  		
	//ЛистMZ.Cells(1, 1).Value = "MZ";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистMZ.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла;	
	//
	//// SLA
	//Знч = ПолучитьТаблицуЗначений(ТекСтрока.SLA);
	//Если Знч = Неопределено Тогда
	//	Сообщить("Ошибка получения значения из хранилища");
	//КонецЕсли;
	//
	////Добавим в книгу новый лист:
	//ЛистSLA = Книга.Sheets.Add();
	//
	//ЛистSLA.Name = "SLA";  		
	//ЛистSLA.Cells(1, 1).Value = "SLA";		
	//
	//НомерСтроки = 2;
	//Для Каждого ТекСтрокаЗнч Из Знч Цикл
	//	ЛистSLA.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
	//	НомерСтроки = НомерСтроки + 1;
	//КонецЦикла; 	
	//	
	////Запишем книгу:
	//Попытка
	//	Книга.SaveAs(ПутьКФайлу); 
	//Исключение
	//	Сообщить(ОписаниеОшибки()+" Файл не сохранен!"); 
	//КонецПопытки;
	//
	////После выполнения действий необходимо закрыть книгу:
	//Эксель.Application.Quit(); 
	//
	//Сообщить("Данные выгружены в файл " + ПутьКФайлу);
	
КонецПроцедуры
// rarus tenkam 10.04.2019 mantis 14195 +++
//&НаКлиенте
//Функция ПолучитьПутьКФайлуВыгрузки(ПолноеИмяФайла)
//	
//	// Вызываем диалог выбора файла для сохранения XLS-таблицы
//	Режим = РежимДиалогаВыбораФайла.Сохранение;
//	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
//	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
//	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
//	Текст = "ru = ""Таблица XLS""; en = ""XLS table""";
//	Фильтр = НСтр(Текст)+"(*.xls)|*.xls";
//	ДиалогОткрытияФайла.Фильтр = Фильтр;
//	ДиалогОткрытияФайла.Заголовок = "Выберите путь для сохранения";
//	ДиалогОткрытияФайла.ПолноеИмяФайла = ПолноеИмяФайла;
//	
//	Если ДиалогОткрытияФайла.Выбрать() Тогда
//		Возврат ДиалогОткрытияФайла.ПолноеИмяФайла;
//	Иначе
//		Возврат "";
//	КонецЕсли;
//	
//	Диалог.Показать(Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект, Новый Структура("Диалог", ДиалогОткрытияФайла)));
//	
//КонецФункции

&НаКлиенте
Процедура ПослеПодключенияРасширения(Результат, ДополнительныеПараметры) Экспорт  
		
	СтруктураОтбора = Новый Структура("Год", Элементы.Список.ТекущиеДанные.Год);
	СтруктураОтбора.Вставить("НомерНедели", Элементы.Список.ТекущиеДанные.НомерНедели);
	ТекСтрока = ПолучитьПлановыеЗначенияИзРегистра(СтруктураОтбора);
	
	ИмяФайла = "Детализация плановых данных " + Элементы.Список.ТекущиеДанные.НомерНедели + "_" + Элементы.Список.ТекущиеДанные.Год;
	
	// Вызываем диалог выбора файла для сохранения XLS-таблицы
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Текст = "ru = ""Таблица XLS""; en = ""XLS table""";
	Фильтр = НСтр(Текст)+"(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите путь для сохранения";
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайла;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ВыгрузитьДанныеЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)));
	
КонецПроцедуры  
// rarus tenkam 10.04.2019 mantis 14195 ---
	
// rarus tenkam 07.03.2018 mantis 9066 ---

// rarus tenkam 10.04.2019 mantis 14195 +++
&НаКлиенте
Процедура ВыгрузитьДанныеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
  
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() <> 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
		ТекСтрока = ДополнительныеПараметры.ТекСтрока; 
	Иначе
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 08.07.2019  mantis 14191 +++
		//Сообщение.Текст = НСтр("ru = 'Путь сохранения не выбран!");
		Сообщение.Текст = НСтр("ru = 'Путь сохранения не выбран!'; en = 'Way of saving does not selected!'");
		//rarus FominskiyAS 08.07.2019  mantis 14191 ---  
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;   	
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки; 
	Книга = Эксель.WorkBooks.Add();
	
	// QuantityOfVisits
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.QuantityOfVisits);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;                 		
	//При создании книги автоматически создаются листы (по умолчанию 3). Нам остается только выбрать нужный:
	ЛистQuantityOfVisits = Книга.WorkSheets(1);
	
	ЛистQuantityOfVisits.Name = "QuantityOfVisits";         		
	ЛистQuantityOfVisits.Cells(1, 1).Value = "QuantityOfVisits";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистQuantityOfVisits.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// AcceptanceHandoverDemoTestRent
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.AcceptanceHandoverDemoTestRent);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	// rarus tenkam 10.10.2019 mantis 14982 +++
	Если Книга.WorkSheets.Count < 2 Тогда 
		// Добавим лист
		ЛистAcceptanceHandoverDemoTestRent = Книга.Sheets.Add();
	Иначе
	// rarus tenkam 10.10.2019 mantis 14982 ---
		ЛистAcceptanceHandoverDemoTestRent = Книга.WorkSheets(2);
	КонецЕсли;	// rarus tenkam 10.10.2019 mantis 14982 +
	
	ЛистAcceptanceHandoverDemoTestRent.Name = "AcceptanceHandoverDemoTestRent";       		
	ЛистAcceptanceHandoverDemoTestRent.Cells(1, 1).Value = "AcceptanceHandoverDemoTestRent";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистAcceptanceHandoverDemoTestRent.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// AdministrationOfVehiclesSales
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.AdministrationOfVehiclesSales);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	// rarus tenkam 10.10.2019 mantis 14982 +++
	Если Книга.WorkSheets.Count < 3 Тогда 
		// Добавим лист
		ЛистAdministrationOfVehiclesSales = Книга.Sheets.Add();	
	Иначе	// rarus tenkam 10.10.2019 mantis 14982 ---
		ЛистAdministrationOfVehiclesSales = Книга.WorkSheets(3);
	КонецЕсли;	// rarus tenkam 10.10.2019 mantis 14982 +
	
	
	ЛистAdministrationOfVehiclesSales.Name = "AdministrationOfVehiclesSales";      		
	ЛистAdministrationOfVehiclesSales.Cells(1, 1).Value = "AdministrationOfVehiclesSales";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистAdministrationOfVehiclesSales.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// QuantityOfVehicles
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.QuantityOfVehicles);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистQuantityOfVehicles = Книга.Sheets.Add();
	
	ЛистQuantityOfVehicles.Name = "QuantityOfVehicles";  		
	ЛистQuantityOfVehicles.Cells(1, 1).Value = "QuantityOfVehicles";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистQuantityOfVehicles.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// GenSetsTransportation
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.GenSetsTransportation);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистGenSetsTransportation = Книга.Sheets.Add();
	
	ЛистGenSetsTransportation.Name = "GenSetsTransportation";  		
	ЛистGenSetsTransportation.Cells(1, 1).Value = "GenSetsTransportation";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистGenSetsTransportation.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	// JockeyTransportation
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.JockeyTransportation);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистJockeyTransportation = Книга.Sheets.Add();
	
	ЛистJockeyTransportation.Name = "JockeyTransportation";  		
	ЛистJockeyTransportation.Cells(1, 1).Value = "JockeyTransportation";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистJockeyTransportation.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;  	
	
	// TruckOnTruckDelivery
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.TruckOnTruckDelivery);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистTruckOnTruckDelivery = Книга.Sheets.Add();
	
	ЛистTruckOnTruckDelivery.Name = "TruckOnTruckDelivery";  		
	ЛистTruckOnTruckDelivery.Cells(1, 1).Value = "TruckOnTruckDelivery";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистTruckOnTruckDelivery.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// Jenty
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.Jenty);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистJenty = Книга.Sheets.Add();
	
	ЛистJenty.Name = "Jenty";  		
	ЛистJenty.Cells(1, 1).Value = "Jenty";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистJenty.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
		
	// BodybuiltUnits
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.BodybuiltUnits);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистBodybuiltUnits = Книга.Sheets.Add();
	
	ЛистBodybuiltUnits.Name = "BodybuiltUnits";  		
	ЛистBodybuiltUnits.Cells(1, 1).Value = "BodybuiltUnits";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистBodybuiltUnits.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;   
	
	// Buses
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.Buses);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистBuses = Книга.Sheets.Add();
	
	ЛистBuses.Name = "Buses";  		
	ЛистBuses.Cells(1, 1).Value = "Buses";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистBuses.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// Engines
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.Engines);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистEngines = Книга.Sheets.Add();
	
	ЛистEngines.Name = "Engines";  		
	ЛистEngines.Cells(1, 1).Value = "Engines";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистEngines.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	// BusChassis
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.BusChassis);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистBusChassis = Книга.Sheets.Add();
	
	ЛистBusChassis.Name = "BusChassis";  		
	ЛистBusChassis.Cells(1, 1).Value = "BusChassis";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистBusChassis.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	// MS
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.MS);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистMS = Книга.Sheets.Add();
	
	ЛистMS.Name = "MS";  		
	ЛистMS.Cells(1, 1).Value = "MS";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистMS.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	// MZ
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.MZ);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистMZ = Книга.Sheets.Add();
	
	ЛистMZ.Name = "MZ";  		
	ЛистMZ.Cells(1, 1).Value = "MZ";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистMZ.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;	
	
	// SLA
	Знч = ПолучитьТаблицуЗначений(ТекСтрока.SLA);
	Если Знч = Неопределено Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Ошибка получения значения из хранилища");
		Сообщить(НСтр("ru = 'Ошибка получения значения из хранилища'; en = 'Action failed'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
	
	//Добавим в книгу новый лист:
	ЛистSLA = Книга.Sheets.Add();
	
	ЛистSLA.Name = "SLA";  		
	ЛистSLA.Cells(1, 1).Value = "SLA";		
	
	НомерСтроки = 2;
	Для Каждого ТекСтрокаЗнч Из Знч Цикл
		ЛистSLA.Cells(НомерСтроки, 1).Value = Строка(ТекСтрокаЗнч);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 	
		
	//Запишем книгу:
	Попытка
		Книга.SaveAs(ПутьКФайлу); 
	Исключение
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить(ОписаниеОшибки()+" Файл не сохранен!");
		Сообщить(ОписаниеОшибки()+НСтр("ru = ' Файл не сохранен!'; en = ' The file is not saved!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---   
	КонецПопытки;
	
	//После выполнения действий необходимо закрыть книгу:
	Эксель.Application.Quit(); 
	
	//rarus FominskiyAS 08.07.2019  mantis 14191 +++
	//Сообщить("Данные выгружены в файл " + ПутьКФайлу);
	Сообщить(НСтр("ru = 'Данные выгружены в файл '; en = 'Data uploaded into the file '") + ПутьКФайлу);
	//rarus FominskiyAS 08.07.2019  mantis 14191 ---  

КонецПроцедуры
// rarus tenkam 10.04.2019 mantis 14195 ---
